app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 3], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
  def index
    @posts = Post.posts_by(current_user).page(params[:page]).per(10)

INSERT INTO "posts" ("date", "rationale", "created_at", "updated_at", "user_id", "overtime_request") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2017-05-08"], ["rationale", "beca beca"], ["created_at", "2017-05-10 22:11:47.658392"], ["updated_at", "2017-05-10 22:11:47.658392"], ["user_id", 1], ["overtime_request", 3.5]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save

UPDATE "posts" SET "status" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["status", 1], ["updated_at", "2017-05-10 13:59:41.113456"], ["id", 1]]
---
  def update
    authorize @post

    if @post.update(post_params)