app/controllers/static_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."status" = ?  [["status", 0]]
SELECT  "audit_logs".* FROM "audit_logs" ORDER BY "audit_logs"."id" DESC LIMIT ?  [["LIMIT", 10]]
---
  def homepage
    @pending_approvals = Post.where(status: 'submitted')
    @recent_audit_items = AuditLog.last(10)